---
kind: method
id: M:Autodesk.Revit.DB.ImageTypeOptions.Dispose
source: html/8665df9b-7082-9cd5-b4dd-b0f1aa650140.htm
---
# Autodesk.Revit.DB.ImageTypeOptions.Dispose Method

Releases all resources used by the ImageTypeOptions

## Syntax (C#)
```csharp
public void Dispose()
```